{
  "services": [
      {"since": "2009", "icon": 0, "rating": 5, "title": "Development", "description": "I accept assignments for software development, web design, app development and complex integrations related tasks as a freelancer. If you are a hiring manager and would like to hire me for an opportunity in your organization, I will be happy to discuss the profile and position with you. You can also refer me to other managers."},
      {"since": "2016", "icon": 1, "rating": 4.5, "title": "Training", "description": "I conduct online and in-person training sessions for topics related to Software Development, .Net Technologies, Java (Core, Advanced, EE), SQL, Web Development, Mobile App Development (React Native and Xamarin), DevOps (CI/CD) and Microservices (Docker and Kubernetes)"},
      {"since": "2017", "icon": 2, "rating": 5, "title": "Consulting", "description": "I like solving problems and helping others using the skills that I have acquired over my career as an IT professional. One of the ways of doing so is through consultation and mentoring. If you have a problem that you would like to solve using technology, hit me up and I will be happy to discuss and work with you in solving the problem."},
      {"since": "2017", "icon": 3, "rating": 4.8, "title": "DevOps", "description": "Since late 2017 (October) I have been working on seting up complext CI/CD pipelines using tools like Teamcity, Travis CI and AppVeyor etc. at work and for my personal projects. I have experience configuring the full git flow based CI/CD workflows with automatic deployments and release management. I am proud to say that one of systems that I created at work is fully automated and we release several times a day with full git flow (including code review checks and QA approvals). We do a build on every PR and run a full suite of unit and integration tests. I have also worked with code coverage tools like codecov and open cover. If you need help with configuration or tuning of a CI/CD system, I will be glad to discuss."},
      {"since": "2017", "icon": 4, "rating": 4.8, "title": "Microservices", "description": "Microservices help organizations move fast, scale better and reduce friction in the development and release process. I have been working with tools like Docker (since last 2017) and with Kubernetes (March 2018). With Docker you can create packaged modules which are idempotent across platforms and act like sef contained units, Kubernetes helps in composing complex systems using these self contained modules and provides options for scalability and load balancing based on usage and load. If you have a monolithic system and would like to discuss if you should move to Microservices (not every system should) and what strategy you can follow, please get in touch."},
      {"since": "2016", "icon": 5, "rating": 5, "title": "Cloud Architect", "description": "Cloud is the way going forward. We use a private cloud at work (openstack based) and I have been working with public cloud servies like AWS and Azure for my personal work and some of my clients projects. For instance this website is setup on AWS S3 and is using the AWS CloudFront CDN for serving you the React App. This is a Mini CMS system powered through GitHub (the content is coming from a GitHub Repo). I have experience in setting up majority of services like VMs, Storage, DB (RDBMS and NoSql), Hadoop and Spark jobs, Serverless Apps, Apis and Kubernetes clusters. With my experience and expertise you will be able to setup a scalable and cost effective cloud solution without having to hire consultants for different roles. If you need help setting up VPC due to regulations like GDPR I am here to help."}
    ]
}
