{
  "testimonials": [
    {
      "name": "Ankur Thakur",
      "position": "Managing Director",
      "company": "Veridic Technologies Pvt Ltd",
      "linkedInLink": "https://www.linkedin.com/in/ankur-thakur-20b31976/",
      "website": "https://www.veridic.co.uk/",
      "avatarUrl": "https://www.pradeep.vip/images/ankur-thakur.jpeg",
      "recommendation": "I have worked with Pradeep for several years on numerous projects. He was very driven and extremely passionate about his work. He always went out of the way to ensure that the best product was delivered and he had a knack to look at a problem from all angles before working out a solution. He is not only very intelligent, but also possesses great communication and customer facing skills due to which he adds immense value to any team he is working in. One of the most flexible people I have worked with who had the ability to take on any role given to him and deliver outstanding results in all of them."
    },
    {
      "name": "A. Fabrizio Cicenia",
      "position": "Sr. Director IT - LATAM",
      "company": "Brightstar Corp.",
      "linkedInLink": "https://www.linkedin.com/in/fabriziocicenia/",
      "website": "https://www.brightstar.com/",
      "avatarUrl": "https://www.pradeep.vip/images/fabrizio-cicenia.jpeg",
      "recommendation": "Pradeep has shown an extremely high level of intellectual curiosity, independence and self-motivation throughout the time I have met him. He has always been very customer service oriented, and is very skilled at building rapport with customer. Additionally he is very well organized and possesses very strong administrative skills. In short, I give Pradeep my highest recommendation. He is one of the best consultants I have supervised and is a talented Project Manager, Developer and person as a whole. Pradeep is able to create and implement new projects very easily, and has an eager mind that seeks to understand everything he is doing. I strongly recommend him without reservation."
    },
    {
      "name": "Lalit Mohan",
      "position": "Senior Technical Architect",
      "company": "Veridic Technologies",
      "linkedInLink": "https://www.linkedin.com/in/tolalitmohan/",
      "website": "https://www.veridic.co.uk/",
      "avatarUrl": "https://media.licdn.com/dms/image/C5103AQGQedXNR405tQ/profile-displayphoto-shrink_800_800/0?e=1559779200&v=beta&t=vUee3kBwb03yYqjqAiz5GzLK1dX-1g50m2TxYMx-w-s",
      "recommendation": "Pradeep is the most techie guy i have come across in my entire career. He has this do or die attitude which ensures complete success of any project he takes. His approach is systematic and technical. He is not only intelligent but also very hardworking and can work tirelessly and the time frame looses its significance. He never says NO but finds ways and means to accomplish the task assigned to him. He's been very quick to understand the business requirements and convert these requirements into technical speak and get it implemented. Working with Pradeep was a pleasure. I would wish Pradeep all the very best for all his future endeavours."
    },
    {
      "name": "Sanjeev Bhardwaj",
      "position": "Project Manager",
      "company": "Veridic Technologies",
      "linkedInLink": "https://www.linkedin.com/in/sanjeev-bhardwaj-b9974b64/",
      "website": "https://www.veridic.co.uk/",
      "avatarUrl": "https://www.pradeep.vip/images/sanjeev-bhardwaj.jpeg",
      "recommendation": "I rarely come across real talents who stand out like Pradeep. I had the pleasure of working with Pradeep for almost three years at the Veridic Technologies, collaborating on several project teams. He has been really a great hand in  programming and was always keen to work on latest technologies. Pradeep's ability to handle or design any project was unlike any I’ve seen before and is really a dramatic increase in the productivity level for any company. No matter how difficult the situation is, I have seen him thriving always with a positive mindset. Not to mention, his ability to communicate with the business sponsors has always been outstanding. I would wish him all the best for his future and keep on exploring the new world!!"
    }
  ]
}
